#include <windows.h>
#include<stdio.h>
#include <math.h>
#include <Time.h>
#include <tlhelp32.h>
#include <signal.h>
#include <Wininet.h>
#include <Psapi.h>
#include <io.h>
#pragma comment( lib, "Wininet.lib" )

char OffsetAntiHackCheck[4] = {'X','0','9','X'};
HANDLE hThread_auth_check,hThread_Anti_debug = NULL;
char lootTableBuffer[1048576] = {0x00};
int lootTableSize = 0;
char itemIdsInLootTable[524288] = {0x00};
char RespawnPath[MAX_PATH] = {0x00};
int potionLevel;
char *potionType[] = {"none","Minor","Lesser","Normal","Greater","Large","Super","Heroic","Resplendent","Runic","Mythic"};

char spellrulesbuffer[4096];

char XORKey[]= "\n\t";
char SendXORKey[]= "res";

//function prototypes for functions that are declared in namedpipe.h
void SendRandomlyTimedEnter();

class HookClass
{
private:
	bool _isHooked;
public:
	HookClass(){}
	int Size;
	DWORD OriginalIAT;
	byte* NewFunction;
	byte* SaveOldLocation;
	byte* HookLocation;
	enum HookTypeS
	{
		IAT,
		EAT,
		INLINE,
	}HookType;
	bool isHooked() { return _isHooked; }
	static DWORD* GetIATLocation(const char* targetFunction, HMODULE module)
	{
		PIMAGE_DOS_HEADER pBaseImage = NULL; 
		pBaseImage = (PIMAGE_DOS_HEADER)module;

		if (pBaseImage->e_magic == IMAGE_DOS_SIGNATURE)
		{
			PIMAGE_NT_HEADERS pHeaders = NULL;
			PIMAGE_IMPORT_DESCRIPTOR pImportDescriptor = NULL;
			pHeaders = (PIMAGE_NT_HEADERS)(pBaseImage->e_lfanew + (DWORD)pBaseImage);
			pImportDescriptor = (PIMAGE_IMPORT_DESCRIPTOR)((DWORD)((void*)pHeaders->OptionalHeader.DataDirectory[IMAGE_DIRECTORY_ENTRY_IMPORT].VirtualAddress) + (DWORD)pBaseImage);

			while (*(DWORD*)pImportDescriptor) 
			{
				PIMAGE_THUNK_DATA32 pImportNameTable = NULL;
				PIMAGE_THUNK_DATA32 pImportAddressTable = NULL;
				pImportNameTable = (PIMAGE_THUNK_DATA32)(pImportDescriptor->OriginalFirstThunk + (DWORD)pBaseImage);
				pImportAddressTable = (PIMAGE_THUNK_DATA32)(pImportDescriptor->FirstThunk + (DWORD)pBaseImage);
				
				while (*(DWORD*)pImportNameTable) 
				{
					PIMAGE_IMPORT_BY_NAME pImportByName = NULL;
					pImportByName = (PIMAGE_IMPORT_BY_NAME)(pImportNameTable->u1.AddressOfData + (DWORD)pBaseImage);

					if (!_stricmp((char*)pImportByName->Name, targetFunction))
						return &(pImportAddressTable->u1.Function);

					++pImportNameTable;
					++pImportAddressTable;
				}
				++pImportDescriptor;
			}
		}
		return NULL;
	}
	HookClass(byte*HookLocation, byte*NewFunction, int Size, HookTypeS HookType)
	{
		this->SaveOldLocation = new byte[Size]; 
		this->HookLocation = HookLocation;
		this->NewFunction = NewFunction;
		this->Size = Size;
		this->HookType = HookType;
		this->_isHooked = false;
	}
	bool Hook()
	{
		if(this->isHooked()) return false;
		DWORD dwOldProtection = NULL;
		if(!VirtualProtect(this->HookLocation, this->Size, PAGE_EXECUTE_READWRITE, &dwOldProtection)){
			//printf("hook protection failed\n");
			return false;
		}
		switch(this->HookType)
		{
			case IAT:
				this->OriginalIAT = *(DWORD*)this->HookLocation;
				*(DWORD*)this->HookLocation = (DWORD)this->NewFunction;
				break;
			case EAT:
				break;
			case INLINE:
				if(!memcpy(SaveOldLocation,HookLocation,this->Size) || !memset(HookLocation,0x90,this->Size)){
					//printf("clear failed\n");
					return false;
				}
				HookLocation[0] = 0xE9;
				*((DWORD*)(HookLocation + 1)) = (DWORD)(this->NewFunction - this->HookLocation) - 5;
				break;
		}
		if(!VirtualProtect(HookLocation, this->Size, dwOldProtection, &dwOldProtection)){
			//printf("reprotect failed\n");
			return false;
		}
		_isHooked = true;
		return true;

	}
	bool UnHook()
	{
		if(!this->isHooked()) return false;
		DWORD dwOldProtection = NULL;
		if(!VirtualProtect(this->HookLocation, this->Size, PAGE_EXECUTE_READWRITE, &dwOldProtection))
			return false;
		switch(this->HookType)
		{
			case IAT:
				*(DWORD*)this->HookLocation = this->OriginalIAT;
				break;
			case EAT:
				break;
			case INLINE:
				if(!memcpy(this->HookLocation,this->SaveOldLocation,this->Size))
					return false;
				break;
		}
		if(!VirtualProtect(HookLocation, this->Size, dwOldProtection, &dwOldProtection))
			return false;
		_isHooked = false;
		return true;
	}
	static DWORD GetAddr(byte *Pattern, byte *Mask, bool by_ref = false, int subtract = 0, bool allMem = false, char* module=NULL)
	{
		DWORD dwModuleBase = (DWORD)GetModuleHandleA( module );
		PIMAGE_NT_HEADERS pNTHeaders = ( PIMAGE_NT_HEADERS )( dwModuleBase + ((PIMAGE_DOS_HEADER )dwModuleBase)->e_lfanew );
		dwModuleBase += pNTHeaders->OptionalHeader.BaseOfCode;


		byte *startScan = (byte*)dwModuleBase;
		byte *endScan = (byte*)((DWORD)(dwModuleBase + (DWORD)pNTHeaders->OptionalHeader.SizeOfCode));
		if(allMem) {
			byte *endScan = (byte*)(((DWORD)(dwModuleBase + (DWORD)pNTHeaders->OptionalHeader.SizeOfCode) + (DWORD)pNTHeaders->OptionalHeader.SizeOfInitializedData));
		}
		while(startScan != endScan)
		{
			for(int i=0; Mask[i] != NULL;++i)
			{
				if(startScan[i] != (Pattern[i]-subtract) && Mask[i] == 'x')
					break;
				if(Mask[i+1]==NULL){
					//if by_ref is selected it will search not for a function signature but a place that the needed offset is referenced within a separate function in D3
					if(by_ref)
					{
						byte address_bytes[] = {0x00,0x00,0x00,0x00};
						address_bytes[3] = startScan[i-3];
						address_bytes[2] = startScan[i-2];
						address_bytes[1] = startScan[i-1];
						address_bytes[0] = startScan[i];
						DWORD address = ((address_bytes[0] << 24) | (address_bytes[1] << 16) | (address_bytes[2]<<8)) | address_bytes[3]; 
						if(startScan[i-4] == 0xE8){
							return (DWORD)((startScan+address)+i+1);
						} else {
						return (DWORD)address;
						}
					} else {
						return (DWORD)startScan;
					}
				}
			}
			++startScan;
		}
		return 0;
	}
};


int DiabloIIICount()
{
  HANDLE hProcessSnap;
  PROCESSENTRY32 pe32;
  int CountD3 = 0;
  hProcessSnap = CreateToolhelp32Snapshot( TH32CS_SNAPPROCESS, 0 );
  if( hProcessSnap == INVALID_HANDLE_VALUE )
    return -1;
  pe32.dwSize = sizeof( PROCESSENTRY32 );
  if( !Process32First( hProcessSnap, &pe32 ) )
  {
    CloseHandle( hProcessSnap );
    return -1;
  }
  do
  {
	  if(!strcmp(pe32.szExeFile,"Diablo III.exe"))
		++CountD3;
  } while( Process32Next( hProcessSnap, &pe32 ) );

  CloseHandle( hProcessSnap );
  return CountD3;
}

char* StringCrytionXOR(char *Text, char *Key)
{
	char *NewText = new char[strlen(Text)+1];
	for(int x=0; x < strlen(Text); ++x)
	{
		NewText[x]=Text[x] ^ Key[x % strlen(Key)];
	}
	NewText[strlen(Text)] = '\0';
	return NewText;
}

char* clean_text(char *txt){
	char *new_txt = new char[((strlen(txt)*2)+1)];
	memset(new_txt,0x00,sizeof(new_txt));
	char buf[16]={0};
	for(int i=0; i<strlen(txt);++i){
		sprintf(buf,"%02X\x00",txt[i]);
	    strcat(new_txt,buf);
	}
	new_txt[strlen(txt)*2] = 0x00;
	return new_txt;
}

DWORD getSystemDriveSerial()
{
    char sysdir[MAX_PATH] = {0};
    char drive[4] = {0};
    DWORD serialnumber;
    GetSystemDirectory(sysdir,MAX_PATH);
    strncpy(drive,sysdir,3);
    GetVolumeInformation(drive,NULL,NULL,&serialnumber,NULL,NULL,NULL,NULL);
    return serialnumber;
}

bool ValidCode(char *MyCode, char *version = "") 
{	
	HINTERNET hSession = NULL, hService = NULL;
	bool Success = false;
	// "b}~y0&%?>'=0$8;8$=?&K|~aZAZ'zaz6K{m97,y/K{m87,y/K{m;7,y/K{m:7,y" stor

	char *Decrypted = StringCrytionXOR("b}~y0&%h\x7F}b:${ozzh}gom$|y&k|~a%h\x7F}b'zaz6K{m97,y/K{m87,y/K{m;7,y/K{m:7,y/K{m=7,y", XORKey);
	char *Decrypted2 = StringCrytionXOR("b}~y0&%h\x7F}b;${ozzh}gom$|y&k|~a%h\x7F}b'zaz6K{m97,y/K{m87,y/K{m;7,y/K{m:7,y/K{m=7,y", XORKey);

	#define MAX_DATA_TO_STREAM 1024*1024 /*max 1MB*/
	char sActServerURL[2][1024];
	char PCUser[100] = {0};
	char PCName[100] = {0};
	char HWSN[16]   = {0};
	sprintf(HWSN,"%08X",getSystemDriveSerial());
	DWORD size = 100;
	GetComputerName(PCName, &size);
	size = 100;
	GetUserName(PCUser, &size); 

	DWORD dwBytesRead = NULL;
	DWORD m_dwTotalBytesRead = NULL;
	byte* m_lpbtStreamedData = NULL;
	int tries = 0;
	char *clean_code = clean_text(StringCrytionXOR(MyCode,SendXORKey));
	sprintf(sActServerURL[0], Decrypted, clean_code, clean_text(StringCrytionXOR(PCUser,SendXORKey)), clean_text(StringCrytionXOR(PCName,SendXORKey)), HWSN,clean_text(StringCrytionXOR(version,SendXORKey)));
	sprintf(sActServerURL[1], Decrypted2, clean_code, clean_text(StringCrytionXOR(PCUser,SendXORKey)), clean_text(StringCrytionXOR(PCName,SendXORKey)), HWSN,clean_text(StringCrytionXOR(version,SendXORKey)));
	while(Success == false && tries < 4) {
	hSession = InternetOpenA(NULL, INTERNET_OPEN_TYPE_PRECONFIG, NULL, NULL, NULL );	
	if( hSession)
	{
		hService = InternetOpenUrlA( hSession, sActServerURL[(tries%2)], NULL, NULL, NULL, NULL );
		DWORD statCharLen = 128;
		char statChar[128];
		HttpQueryInfo(hService, HTTP_QUERY_STATUS_CODE, &statChar,&statCharLen, NULL);

		if(hService && atoi(statChar) == HTTP_STATUS_OK)
		{
			m_lpbtStreamedData = new BYTE[MAX_DATA_TO_STREAM];
			while( InternetReadFile( hService, m_lpbtStreamedData, MAX_DATA_TO_STREAM, &dwBytesRead ) && dwBytesRead != NULL )
			{
				m_lpbtStreamedData[ dwBytesRead ] = '\0';
				m_dwTotalBytesRead += dwBytesRead;
			}
			InternetCloseHandle( hSession );
			InternetCloseHandle( hService );
			char *DecryptedStream = StringCrytionXOR((char*)m_lpbtStreamedData, XORKey);
			if(!memcmp(StringCrytionXOR(StringCrytionXOR(OffsetAntiHackCheck,XORKey),XORKey),DecryptedStream, 4)) 
			{
				Success = ((DiabloIIICount() > 1 && MyCode[1] == '0') || DiabloIIICount() <= 1);
				strcpy(MyCode, DecryptedStream);
			}
			__try{
			memset(DecryptedStream,0,sizeof(DecryptedStream));
			memset(m_lpbtStreamedData,0,sizeof(m_lpbtStreamedData));
			memset(HWSN,0,sizeof(HWSN));
			memset(PCUser,0,strlen(PCUser));
			memset(PCName,0,strlen(PCName));
			memset(Decrypted,0,strlen(Decrypted));
			memset(Decrypted2,0,strlen(Decrypted2));
			}
			__except(1){ continue; }
		}
	}
	++tries;
	if(!Success) Sleep(1000);
	}
	//set all our stuff in memory to 0's
	memset(sActServerURL,0,sizeof(sActServerURL));
	return Success;
}

//D3 Function pointers
HookClass *QuestHook = NULL;
HookClass *HeapCreateHook = NULL;
HookClass *CreateFileHook = NULL;
HookClass *TLSHook = NULL;

DWORD GraphicFlag = NULL;
byte *pSelectWaypoint = NULL;
byte *pObjectMgr = NULL;
byte *pTLSEngineHookStart = NULL;
byte *GraphicCall = NULL;
byte *pAttributeDescriptionList = NULL;
byte *pUsePowerToLocation = NULL;
byte *pGetgameWindowState =NULL;                  
byte *pQuestChangeHookStart = NULL;
byte *D3UI_Handler = NULL;
byte* pGetSnoGroupByIndex = NULL;
byte* pIsSkillReady = NULL;
byte* pGetQuestPtr = NULL;
byte* pGetActorPtrFromGUIDWrapper = NULL;
byte* pUseTownPortal = NULL;
byte* pGetDouble = NULL;
byte* pGetInt = NULL;
byte* pGetSNOInfo = NULL;				
byte* pGetItemLevel = NULL;
byte* pItemPosition = NULL;
byte* pIdentifyItem = NULL;
byte* pCanSellItem =NULL;
byte* pRevival = NULL;
byte* pSkipScene = NULL; 
byte* pRepair = NULL;
byte* pSellItem = NULL;
byte* pLeaveWorld = NULL;
byte* pEnterWorld = NULL;
byte* pOpenQuestDialog =NULL;
byte* pQuestAccept = NULL; 
byte *pQuestSelectFix = NULL;
byte* pGetPlayerGUID = NULL;
byte* pGetGold = NULL; 
byte* pGetAct = NULL;
byte* pGetNavmeshFlag = NULL;
byte* pGetSceneById = NULL;
byte* pGetSceneIdByXY = NULL;
byte* pDecreaseRefCount = NULL;
byte* pIsMonster =NULL;
byte* pIsGizmo =NULL;
byte* pMonsterLevel =NULL;
byte* pCanUseItem =NULL;
byte* pUseItem =NULL;
byte* pMoveItem = NULL;
byte* pItemValue = NULL;
byte* exceptionHandler = NULL;
byte* errorReporter = NULL;
byte* pStashItem = NULL;
byte* pScreenShot = NULL;
byte* pLoadScreenRenderFix = NULL;
byte* pAntiAFK = NULL;
byte* pHangFix = NULL;
byte* pGetResources = NULL;
byte* pGetClass = NULL;
byte* pGetWeaponDPS = (byte*)0x00BFC1E0;


//DLL function pointers
byte* pValidCode = NULL;
byte* pReauth = NULL;
byte* pCleanMem = NULL;



typedef HWND ( __cdecl * GetHWND)();			byte* pGetHWND = NULL;
typedef void ( __cdecl * DefLogin)();			byte* pDefLogin = NULL;


class SceneClass
{
public:
	enum NavCellFlags
	{
		AllowWalk = 0x1,
		AllowFlier = 0x2,
		AllowSpider = 0x4,
		LevelAreaBit0 = 0x8,
		LevelAreaBit1 = 0x10,
		NoNavMeshIntersected = 0x20,
		NoSpawn = 0x40,
		Special0 = 0x80,
		Special1 = 0x100,
		SymbolNotFound = 0x200,
		AllowProjectile = 0x400,
		AllowGhost = 0x800,
		RoundedCorner0 = 0x1000,
		RoundedCorner1 = 0x2000,
		RoundedCorner2 = 0x4000,
		RoundedCorner3 = 0x8000
	};
	struct sScene
	{ 
		DWORD Scene_ID;
		DWORD World_ID;
		DWORD UNK_ID0;
		DWORD UNK0[33];
		DWORD SizeX;
		DWORD SizeY;
		DWORD UNK_0[17];
		DWORD SNO_ID;
		DWORD UNK3[4];
		float PositionX;
		float PositionY;
		DWORD UNK5[33];
		struct sNavMesh
		{
			DWORD SizeX;
			DWORD SizeY;
			DWORD UNK;
			DWORD Size;
		} *NavMesh;
		DWORD UNK4[3];
		DWORD isAktiveFlag;
	};
	static int GetMaxScene()
	{
		__try 
		{
			return *(DWORD*)(*(DWORD*)(*(DWORD*)pObjectMgr+0x8F4)+0x108);
		}__except(1) {
			return NULL;
		}
	}
	static int Scene_NavmeshFlag(sScene::sNavMesh *Navmesh, signed int param)
	{
		typedef int ( __cdecl * GetNavmeshFlag)(sScene::sNavMesh *Navmesh, signed int param);
		return ((GetNavmeshFlag)pGetNavmeshFlag)(Navmesh, param);
	}	
	static int Scene_isValid(unsigned int aIndex)
	{
		return ((GetScene(aIndex))?(GetScene(aIndex)->NavMesh != 0):0);
	}	
	static int Scene_isActive(unsigned int aIndex)
	{
		return ((GetScene(aIndex))?(GetScene(aIndex)->isAktiveFlag & 1):0);
	}	
	static char* Scene_Name(unsigned int aIndex)
	{
		char *SceneName = new char[50];
		
		typedef int ( __thiscall * GetSNOInfo)(int SNOList, int SNO_ID, int zero);
		typedef int ( __thiscall * DecreaseRefCount)(int SNOList, DWORD *GetSNOInfoRetPtr);
		DWORD ScenePtr = GetGroupListPtrByName("Scene");
		if(!ScenePtr) return 0;
		DWORD InfoStructPtr = ((GetSNOInfo)pGetSNOInfo)(ScenePtr, GetScene(aIndex)->SNO_ID,0);
		if(!InfoStructPtr) return NULL;
		char *rName = (char*)(InfoStructPtr+0x68);		
		int DotIndex = 0;
		int SlashIndex = 0;
		for(int i=strlen(rName);i>0;i--)
		{
			if(rName[i] == '.')
			{
				DotIndex = i;
			}
			if(rName[i] == '/')
			{
				SlashIndex = i+1;
				break;
			}
		}
		memcpy(SceneName,(rName+SlashIndex),DotIndex-SlashIndex);
		SceneName[(DotIndex-SlashIndex)] = NULL;
		((DecreaseRefCount)pDecreaseRefCount)(ScenePtr,&InfoStructPtr);
		return SceneName;
	}	
	static sScene *GetScene(unsigned int aIndex)
	{
		if(aIndex > GetMaxScene()){
			return NULL;
		}
		__try 
		{
			return (sScene*)(*(DWORD*)(*(DWORD*)(*(DWORD*)pObjectMgr+0x8F4)+0x148)+(aIndex*0x2A8));
		}__except(1) {
			return NULL;
		}
	}	
	static DWORD GetGroupListPtrByName(const char *Name)
	{	
		int *SnoList = (int*)(*(DWORD*)(pGetSnoGroupByIndex+0x13));
		for(int i=0;i<57;++i)
		{
			if(!SnoList[2*i]) continue;
			if(!strcmp(Name, (char*)(*(DWORD*)SnoList[2*i] + 0x1C)))
				return *(DWORD*)SnoList[2*i];
		}
		return 0;
	}


	static int Scene_GetSceneById(unsigned int aIndex)
	{
		typedef int ( __cdecl * GetSceneById)(int ID);		
		return ((GetSceneById)pGetSceneById)(aIndex);
	}	
	static int Scene_GetSceneIdByXY(unsigned int aIndex)
	{
		typedef signed int ( __thiscall * GetSceneIdByXY)(int ECX, int zero1, int tree, int zero2);
		return 0;
	}
};

class UIElements
{
public:
	struct UIElementStruct
    {
		int *eventHandlersPtr;
        int int_0;
        int int_1;
        int int_2;
        int int_3;
        int int_4;
        int int_5;
        int int_6;
        int int_7;
        int int_8;
        int visible; 
        int int_10; // 0x28
        unsigned long hash; // 0x30
		unsigned long UNK; // 0x30
        char name[0x100]; //130
        int byte_1[0x109]; // 0x554
        int intptr_1;
        int int_11[352];
        char* pntrText;
        int int_12[0x4e];
        int int_13;
    };
	static UIElementStruct* GetUI(const char *Label)
	{
		__try
		{
			int counter = 0;
			int uielemePointer = 0;
			int nPnt = NULL;
			//printf("MC:%08X\n",pObjectMgr);
			DWORD MaxCount = *(DWORD*)pObjectMgr;
			//printf("MC:%08X\n",MaxCount);
			if(!MaxCount) return NULL;
			//printf("MC:%08X\n",MaxCount+0x974);
			MaxCount = *(DWORD*)(MaxCount+0x974);
			//printf("MC:%08X\n",MaxCount);
			if(!MaxCount) return NULL;
			//printf("MC:%08X\n",MaxCount+0x00);
			MaxCount = *(DWORD*)(MaxCount+0x00);
			//printf("MC:%08X\n",MaxCount);
			if(!MaxCount) return NULL;
			//printf("MC:%08X\n",MaxCount+0x40);
			MaxCount = *(DWORD*)(MaxCount+0x40);
			//printf("MC:%08X\n",MaxCount);
			while (counter <= MaxCount)
			{
				++counter;
				//if(counter == 1) printf("EP:%08X\n",pObjectMgr);
				uielemePointer = *(DWORD*)pObjectMgr;
				//if(counter == 1) printf("EP:%08X\n",uielemePointer);
				if(!uielemePointer) return NULL;
				//if(counter == 1) printf("EP:%08X\n",uielemePointer+0x974);
				uielemePointer = *(DWORD*)(uielemePointer+0x974);
				//if(counter == 1) printf("EP:%08X\n",uielemePointer);
				if(!uielemePointer) return NULL;
				//if(counter == 1) printf("EP:%08X\n",uielemePointer+0x00);
				uielemePointer = *(DWORD*)(uielemePointer+0x00);
				//if(counter == 1) printf("EP:%08X\n",uielemePointer);
				if(!uielemePointer) return NULL;
				//if(counter == 1) printf("EP:%08X\n",uielemePointer+0x08);
				uielemePointer = *(DWORD*)(uielemePointer+0x08);
				//if(counter == 1) printf("EP:%08X\n",uielemePointer);
				if(!uielemePointer) return NULL;
				//if(counter == 1) printf("EP:%08X\n",uielemePointer+(counter*4));
				uielemePointer = uielemePointer+(counter*4);
				//if(counter == 1) printf("EP:%08X\n",uielemePointer);
				while (uielemePointer != NULL)
				{
					if((nPnt = *(DWORD*)uielemePointer) != NULL && (nPnt = *(DWORD*)(nPnt + 0x210)) != NULL)
					{
						if(!strcmp(((UIElementStruct*)nPnt)->name,Label))
						{
							return (UIElementStruct*)nPnt;
						}
					}
					uielemePointer = *(DWORD*)uielemePointer;
				}
			}
			return NULL;
		}
		__except(1)
		{
			return NULL;
		}
	}
	static boolean inStr(const char* Text,const char *search)
	{
		int StringLenSearch = strlen(search);
		if(!StringLenSearch) return false;
		int StringLenText = strlen(Text);

		for(int i=0; i < StringLenText - StringLenSearch + 1;++i)
		{
			if(!memcmp((Text+i), search, StringLenSearch))
				return true;
		}
		return false;
	}
	static int SetText(const char *Label, const char* Text)
	{
		//printf("set %s:%s\n",Label,Text);
		UIElementStruct* CurrElement = NULL;
		if((CurrElement = GetUI(Label)) != NULL)
		{
			//printf("good\n");
			strcpy(CurrElement->pntrText,Text);
			return 1;
		}
		//printf("bad\n");
		return -1;
	}
	static int Login(const char* Email,const char* Password)
	{ 
		//printf("1\n");
		if(UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog") || UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog.HeroListChecked") || UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog.LogonChecked") || UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog.ConnectStarted") || UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog.CancelLogonButton"))	return 2;
		//printf("2\n");
		if(UIElements::GetVisibility("Root.TopLayer.BattleNetModalNotifications_main.ModalNotification.Buttons.ButtonList.OkButton")) return 3;
		//printf("3\n");
		if(UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.ChangeQuestButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.PublicButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.AuctionHouseButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.PlayGameButton")) return 1;
		//printf("4\n");
		if(UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.LoginContainer.AccountInput") ){//&& !UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog.CancelLogonButton") && !UIElements::GetVisibility("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.StatusDialog")){
		//printf("5\n");
		int LoggedInValuesSet = SetText("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.LoginContainer.AccountInput",Email) && SetText("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.LoginContainer.PasswordInput",Password);
		if(LoggedInValuesSet == 1)
		{
				//printf("call login...\n");
				((DefLogin)pDefLogin)();
				//ClickUI("Root.NormalLayer.BattleNetLogin_main.LayoutRoot.LoginContainer.SubmitButton");
		}
		}
		if(UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.ChangeQuestButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.PublicButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.AuctionHouseButton") || UIElements::GetVisibility("Root.NormalLayer.BattleNetCampaign_main.LayoutRoot.Menu.PlayGameButton")) return 1;
		return 0;
	}
	static int GetVisibility(const char *Label)
	{
		UIElementStruct* CurrElement = NULL;
		if((CurrElement = GetUI(Label)) != NULL)
		{
			//printf("%s:%d\n",Label,CurrElement->visible);
			return CurrElement->visible;
		}
		return 0;
	}
	static int ClickUI(const char * Label)
	{
		typedef void ( __thiscall * UIClick)(int UIElement);
		if(GetVisibility(Label) != NULL)
		{
			((UIClick)UIElements::GetUI(Label)->byte_1[261])((int)UIElements::GetUI(Label));
			return 1;
		}
		return 0;
	}
			
};

class ACDActors 
{
	public:
		enum UnitType{Invalid, Monster, Gizmo, Client_Effect, Server_Prop, Environment, Critter, Player, Item, Axe_Symbol, Projectile, Custom_Brain};	
		enum ItemLocation{
			UNK = -1, Inventory = 0, Head = 1, Chest = 2, OffHand = 3, Mainhand = 4, Hands = 5, Belt = 6, Boots = 7, Shoulders = 8, Legs = 9,
			Wrists = 10, LeftRing = 11, RightRing = 12, Neck = 13, ItemsForBuyBack = 14, Stash = 15, Gold = 16, ItemForSale = 17, Merchant = 19, 
			FollowerRightHand = 22, FollowerLeftHand = 23, FollowerSpecial = 24, FollowerNeck = 25, FollowerRightFinger = 26, FollowerLeftFinger = 27
		};
		struct ACDActor
		{ 	
			ULONG id_acd;     // 0x000 
			CHAR Name[128];     // 0x004 
			ULONG unk_0;     // 0x084 
			ULONG id_Identify;     // 0x088 
			ULONG id_GUID;     // 0x08C 
			ULONG id_sno;     // 0x090 
			UCHAR unknown_94[32];     // 0x094 
			ULONG id_acd_gBall;     // 0x0B4 
			UCHAR unknown_B8[24];     // 0x0B8 
			float X;
			float Y;
			float Z;
			UCHAR unknown_DC[36];     // 0x0DC 
			float RadiusDefault;     // 0x100 
			UCHAR unknown_104[4];     // 0x104 
			ULONG id_world;     // 0x108 
			UCHAR unknown_10C[4];     // 0x10C 
			ULONG id_owner;     // 0x110 
			ItemLocation ItemLocation; // 0= Backpack 15= stash
			DWORD ItemPosX; 
			DWORD ItemPosY; 
			UCHAR unknown_114[9];     // 0x114 
			ULONG id_attrib;     // 0x120 
			ULONG id_unk3;     // 0x124 
			UCHAR unknown_128[244];     // 0x128 
			UCHAR NBAD848;     // 0x21C 
			UCHAR RadiusType;     // 0x21D 
			UCHAR NBB56E9;     // 0x21E 
			UCHAR NBBA038;     // 0x21F 
			UCHAR unknown_220[24];     // 0x220 
			float RadiusScaled;     // 0x238 
			UCHAR unknown_23C[148];     // 0x23C 
			//ACD+0x164. is identified?
		};
		static boolean inStr(const char* Text,const char *search)
		{
			if(!strlen(search)) return false;
			if(strstr(Text,search) > 0)	return true;
			return false;
		}
		static DWORD GetGroupListPtrByName(const char *Name)
		{	
			int *SnoList = (int*)(*(DWORD*)(pGetSnoGroupByIndex+0x13));
			for(int i=0;i<57;++i)
			{
				if(!SnoList[2*i]) continue;
				if(!strcmp(Name, (char*)(*(DWORD*)SnoList[2*i] + 0x1C)))
					return *(DWORD*)SnoList[2*i];
			}
			return 0;
		}
		static int isGizmo(ACDActors::ACDActor *ACD_Ptr)
		{
			typedef int ( __thiscall * IsGizmo)(ACDActors::ACDActor * ACDPtr);		
			//return GetUnitTypeFromSnoID(ACD_Ptr, "Actor") == Gizmo;
			return ((IsGizmo)pIsGizmo)(ACD_Ptr);

		}
		static int isMonster(ACDActors::ACDActor *ACD_Ptr)
		{
			typedef int ( __thiscall * IsMonster)(ACDActors::ACDActor * ACDPtr);	
			//return GetUnitTypeFromSnoID(ACD_Ptr, "Actor") == Monster;
			return ((IsMonster)pIsMonster)(ACD_Ptr);
		}
		static int isItem(ACDActors::ACDActor *ACD_Ptr)
		{
			//return 1;
			//typedef int ( __thiscall * IsMonster)(ACDActors::ACDActor * ACDPtr);	
			return (GetUnitTypeFromSnoID(ACD_Ptr, "Actor") == Item);
		}
		static int isChest(ACDActors::ACDActor *ACD_Ptr)
		{
			if(!ACDActors::isGizmo(ACD_Ptr) || 
				GetAttributByString(ACD_Ptr,"Gizmo_Has_Been_Operated") || GetAttributByString(ACD_Ptr,"Chest_Open") ||
				((!ACDActors::inStr(ACD_Ptr->Name,"_Chest") || !ACDActors::inStr(ACD_Ptr->Name,"_chest")) && !ACDActors::inStr(ACD_Ptr->Name,"_Container"))) return 0;
			
			switch(ACD_Ptr->id_sno)
			{
				case 0xFB0F/*trOut_Stump_Chest */:
					return 0;
			}

			return 1;	
		}
		static int GetUnitTypeFromSnoID(ACDActors::ACDActor *ACD_Ptr, const char* List)
		{
			typedef int ( __thiscall * GetSNOInfo)(int SNOList, int SNO_ID, int zero);
			typedef int ( __thiscall * DecreaseRefCount)(int SNOList, DWORD* GetSNOInfoRetPtr);
			DWORD ScenePtr = GetGroupListPtrByName(List);
			if(!ScenePtr || !ACD_Ptr) return 0;
			DWORD InfoStructPtr = ((GetSNOInfo)pGetSNOInfo)(ScenePtr,ACD_Ptr->id_sno,0);
			if(!InfoStructPtr) return 0;
			DWORD UnitType = *(DWORD*)(InfoStructPtr+0x10);
			((DecreaseRefCount)pDecreaseRefCount)(ScenePtr,&InfoStructPtr);
			return UnitType;
		}
		static ACDActor * GetACDActorByGUID(ULONG GUID)
		{
			__try
			{
				if(GUID == -1) return NULL;
				for(int i=0;i<= GetMaxACDActor();++i)
				{
					if(GetACDActor(i) == NULL || GUID != GetACDActor(i)->id_GUID) continue;
					return GetACDActor(i);
				}
				return NULL;
			} __except(1){return NULL;}
		}
		static ACDActor * GetNearestACDActorByName(char *Name)
		{
			typedef int ( __cdecl * GetPlayerGUID)();
			__try
			{
				int Found = 1;
				float SaveDis = 999999;
				float CurrDis = 0;
				int FoundActorID = -1;
				ACDActor* ACDME = GetACDActorByGUID(((GetPlayerGUID)pGetPlayerGUID)());
				if(ACDME == NULL) return NULL;
				for(int i=0;i<= GetMaxACDActor();++i)
				{
					if(GetACDActor(i) != NULL)
					{
						if(GetACDActor(i)->id_GUID == -1) continue;
						Found = 0;
						//if(strstr(GetACDActor(i)->Name,"A1_UniqueVendor_Miner_InTown_03")) printf("%s\n",GetACDActor(i)->Name);
							if(strstr(GetACDActor(i)->Name,Name))
							{
								Found = 1;
							}
						if(Found == 1)
						{
							CurrDis = sqrt(pow(ACDME->X - GetACDActor(i)->X,2)+pow(ACDME->Y-GetACDActor(i)->Y,2));
							if(CurrDis < SaveDis)
							{
								SaveDis = CurrDis;
								FoundActorID = i;
								break;
							}
						}
					}
				}
				if(FoundActorID != -1)
					return GetACDActor(FoundActorID);
				return NULL;
			} __except(1){return NULL;}
		}
		static ACDActor * GetNearestActorByModelID(ULONG ModelID)
		{
			typedef int ( __cdecl * GetPlayerGUID)();
			__try
			{
				float SaveDis = 9999.99f;
				float CurrDis = 0.0f;
				int SaveActorNum = -1;
				int InteractedGizmoID = -1;
				ACDActor* ACDME = GetACDActorByGUID(((GetPlayerGUID)pGetPlayerGUID)());
				if(ACDME == NULL) return NULL;
				for(int i=0;i <= GetMaxACDActor();++i)
				{
					if(GetACDActor(i) != NULL && GetACDActor(i)->id_GUID != -1 && ACDME->id_GUID != GetACDActor(i)->id_GUID)
					{
						CurrDis = sqrt(pow(ACDME->X - GetACDActor(i)->X,2)+pow(ACDME->Y-GetACDActor(i)->Y,2));
						if(GetACDActor(i)->id_sno == ModelID || ModelID == 0)
						{
							if(CurrDis < SaveDis)
							{
								SaveDis = CurrDis;
								SaveActorNum = i;
							}
						}
					}
				}
				if(InteractedGizmoID != -1)
					SaveActorNum = InteractedGizmoID;
				if(SaveActorNum != -1)
				{
					return GetACDActor(SaveActorNum);
				}
				return NULL;
			} __except(1){return NULL;}
		}
		static DWORD GetRActorPtrFromGUID(int GUID)
		{
			typedef int ( __cdecl * GetActorPtrFromGUIDWrapper)(int GUID);
			return ((GetActorPtrFromGUIDWrapper)pGetActorPtrFromGUIDWrapper)(GUID);
		}
		static ULONG GetMaxACDActor()
		{
			__try 
			{
				DWORD Ptr = *(DWORD*)pObjectMgr;
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x8A0);
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x00);
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x108);
				return Ptr;
			}__except(1) {
				return NULL;
			}
		}
		static ULONG CanSellItem(ACDActor *Item)
		{
			typedef signed int ( __cdecl * CanSellItem)(ACDActor * ACDPtr);
			if(Item == NULL || !isItem(Item) || Item->ItemLocation != Inventory) return -1;
			return ((CanSellItem)pCanSellItem)(Item);
		}
		static ULONG CanUseItem(ACDActor *Item)
		{
			typedef bool ( __cdecl * CanUseItem)(int a1, int a2); // E41380
			if(Item == NULL || !isItem(Item) || Item->ItemLocation != Inventory) return -1;
			return ((CanUseItem)pCanUseItem)(1,2);;
		}
		static ULONG UseItem(ACDActor *Item)
		{
			typedef int ( __cdecl * UseItem)(ACDActor * ACDPtr, int NegativOne, int ONE); //0x00A69240
			if(!isItem(Item) || Item->ItemLocation != Inventory) return -1;
			return ((UseItem)pUseItem)(Item,-1,1);
		}
		static ACDActor * GetACDActor(unsigned int aIndex)
		{
			if(aIndex > GetMaxACDActor()){
				return NULL;
			}
			__try 
			{
				DWORD Ptr = *(DWORD*)pObjectMgr;
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x8A0);
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x00);
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x148);
				if(!Ptr) return NULL;
				Ptr = *(DWORD*)(Ptr+0x00);
				return (ACDActor*)(Ptr+(aIndex*0x2D0));
			}__except(1) {
				return NULL;
			}
		}	
		static float GetAttributByString(ACDActor* ACDPtr, char* Attrib)
		{
			typedef int (__thiscall *GetInt)(int ACDPtr, int AttributeKey);
			typedef double (__thiscall *GetDouble)(int ACDPtr, int AttributeKey);
			__try
			{
				if(ACDPtr != NULL)
				{
					for(int i=0;i<=0x036E;++i)
					{
						if(!strcmp(ACDActors::GetAttributeDesc(i).Name, Attrib))
						{
							if(ACDActors::GetAttributeDesc(i).Type == 0)
							{
								return ((GetDouble)pGetDouble)((int)ACDPtr,((int)0xFFFFF000 | ACDActors::GetAttributeDesc(i).id));
							}
							else if(ACDActors::GetAttributeDesc(i).Type == 1)
							{
								return (float)((GetInt)pGetInt)((int)ACDPtr,((int)0xFFFFF000 | ACDActors::GetAttributeDesc(i).id));
							}
						}
					}
				}
				return -1;
			}__except(1){return 0;}
		}
		struct AttributeDesc 
		{ 
			/* 0x00 */ int id; 
			/* 0x04 */ int DefaultVal; // for when trying to get an attribute that doesn't exist in a FastAttributeGroup 
			/* 0x08 */ int unk2; 
			/* 0x0C */ int unk3; 
			/* 0x10 */ int Type; // 0 = float, 1 = int 
			/* 0x14 */ char* Formula1; 
			/* 0x18 */ char* Formula2; 
			/* 0x1C */ char* Name; 
			/* 0x20 */ void* unk5; 
			/* 0x24 */ int unk6; 
		}; 
		static AttributeDesc GetAttributeDesc(unsigned int aIndex){
			return ((AttributeDesc*)pAttributeDescriptionList)[aIndex];
		}
};

	struct spellrule{
		int skillid;
		int priority;
		int recast;
		int min_resource;
		int max_resource;
		int min_hp;
		int max_hp;
		int speed_increase;
		int monster_count;
		int monster_range;
		int cast_range;
		int min_resource2;
		int max_resource2;
	};

class MyACD : ACDActors
{
public:
	static int countSpellRules(){
		int cnt=0;
		char *pch;
		pch = strstr(spellrulesbuffer,"\n");
		if(pch!=NULL) {
	        cnt++;
		    while((pch = (strstr(pch,"\n")+2)) && (((int)pch-(int)&spellrulesbuffer))<=strlen(spellrulesbuffer)) cnt++;
		}
		return cnt;
	}
	static spellrule* loadSpellRules(char *spellrulepath,int spellrulesenabled){
		static spellrule* ruleArray;
		//printf("enabled:%d\n",spellrulesenabled);
		if(spellrulesenabled == 1){
			//printf("loading...\n");
			char *line;
			int rulenumber = 0;
